# Data Exploration

## Information about the Dataset

In [ ]:
import numpy as np
import pandas as pd

In [2]:
# categories = cities = countries = customers = employees = products = sales = None

In [3]:
tables = [
    "categories",
    "cities",
    "countries",
    "customers",
    "employees",
    "products",
    "sales",
]

In [4]:
# Load the Data
for table in tables:
    data = f'../../data/raw/{table}.csv'
    globals()[table] = pd.read_csv(data)

In [5]:
tables = {
    "categories": categories,    
    "cities": cities,
    "countries": countries,
    "customers": customers,
    "employees": employees,
    "products": products,
    "sales": sales
}

In [17]:
categories.head()

   CategoryID CategoryName
0           1  Confections
1           2   Shell fish
2           3      Cereals
3           4        Dairy
4           5    Beverages

In [18]:
cities.head()

   CityID        CityName  Zipcode  CountryID
0       1          Dayton    80563         32
1       2         Buffalo    17420         32
2       3         Chicago    44751         32
3       4         Fremont    20641         32
4       5  Virginia Beach    62389         32

In [8]:
countries.head()

   CountryID CountryName CountryCode
0          1     Armenia          AN
1          2      Canada          FO
2          3      Belize          MK
3          4      Uganda          LV
4          5    Thailand          VI

In [9]:
customers.head()

,CustomerID,FirstName,MiddleInitial,LastName,CityID,Address
0,1,Stefanie,Y,Frye,79,97 Oak Avenue
1,2,Sandy,T,Kirby,96,52 White First Freeway
2,3,Lee,T,Zhang,55,921 White Fabien Avenue
3,4,Regina,S,Avery,40,75 Old Avenue
4,5,Daniel,S,Mccann,2,283 South Green Hague Avenue

In [10]:
employees.head()

,EmployeeID,FirstName,MiddleInitial,LastName,BirthDate,Gender,CityID,HireDate
0,1,Nicole,T,Fuller,1981-03-07 00:00:00.000,F,80,2011-06-20 07:15:36.920
1,2,Christine,W,Palmer,1968-01-25 00:00:00.000,F,4,2011-04-27 04:07:56.930
2,3,Pablo,Y,Cline,1963-02-09 00:00:00.000,M,70,2012-03-30 18:55:23.270
3,4,Darnell,O,Nielsen,1989-02-06 00:00:00.000,M,39,2014-03-06 06:55:02.780
4,5,Desiree,L,Stuart,1963-05-03 00:00:00.000,F,23,2014-11-16 22:59:54.720

In [11]:
products.head()

,ProductID,ProductName,Price,CategoryID,Class,ModifyDate,Resistant,IsAllergic,VitalityDays
0,1,Flour - Whole Wheat,74.2988,3,Medium,2018-02-16 08:21:49.190,Durable,Unknown,0.0
1,2,Cookie Chocolate Chip With,91.2329,3,Medium,2017-02-12 11:39:10.970,Unknown,Unknown,0.0
2,3,Onions - Cippolini,9.1379,9,Medium,2018-03-15 08:11:51.560,Weak,False,111.0
3,4,"Sauce - Gravy, Au Jus, Mix",54.3055,9,Medium,2017-07-16 00:46:28.880,Durable,Unknown,0.0
4,5,Artichokes - Jerusalem,65.4771,2,Low,2017-08-16 14:13:35.430,Durable,True,27.0

In [12]:
sales.head()

,SalesID,SalesPersonID,CustomerID,ProductID,Quantity,Discount,TotalPrice,SalesDate,TransactionNumber
0,1,6,27039,381,7,0.0,0.0,2018-02-05 07:38:25.430,FQL4S94E4ME1EZFTG42G
1,2,16,25011,61,7,0.0,0.0,2018-02-02 16:03:31.150,12UGLX40DJ1A5DTFBHB8
2,3,13,94024,23,24,0.0,0.0,2018-05-03 19:31:56.880,5DT8RCPL87KI5EORO7B0
3,4,8,73966,176,19,0.2,0.0,2018-04-07 14:43:55.420,R3DR9MLD5NR76VO17ULE
4,5,10,32653,310,9,0.0,0.0,2018-02-12 15:37:03.940,4BGS0Z5OMAZ8NDAFHHP3

In [13]:
# Get the basic information about the dataset

for table_name, table in tables.items():
    print(f"{table_name.upper()}")
    print(f"Data Info: \n{table.info()} \n")

CATEGORIES
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   CategoryID    11 non-null     int64
 1   CategoryName  11 non-null     object
dtypes: int64(1), object(1)
memory usage: 308.0+ bytes
Data Info:
None

CITIES
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 96 entries, 0 to 95
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   CityID     96 non-null     int64
 1   CityName   96 non-null     object
 2   Zipcode    96 non-null     int64
 3   CountryID  96 non-null     int64
dtypes: int64(3), object(1)
memory usage: 3.1+ KB
Data Info:
None

COUNTRIES
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206 entries, 0 to 205
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   CountryID    206 non-null    int64
 1   CountryName  206 non-null    object
 2   CountryCode  205 non-null    object
dtypes: int64(1), object(2)
memory usage: 5.0+ KB
Data Info:
None

CUSTOMERS
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 98759 entries, 0 to 98758
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   CustomerID     98759 non-null  int64
 1   FirstName      98759 non-null  object
 2   MiddleInitial  97782 non-null  object
 3   LastName       98759 non-null  object
 4   CityID         98759 non-null  int64
 5   Address        98759 non-null  object
dtypes: int64(2), object(4)
memory usage: 4.5+ MB
Data Info:
None

EMPLOYEES
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23 entries, 0 to 22
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   EmployeeID     23 non-null     int64
 1   FirstName      23 non-null     object
 2   MiddleInitial  23 non-null     object
 3   LastName       23 non-null     object
 4   BirthDate      23 non-null     object
 5   Gender         23 non-null     object
 6   CityID         23 non-null     int64
 7   HireDate       23 non-null     object
dtypes: int64(2), object(6)
memory usage: 1.6+ KB
Data Info:
None

PRODUCTS
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 452 entries, 0 to 451
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ProductID     452 non-null    int64
 1   ProductName   452 non-null    object
 2   Price         452 non-null    float64
 3   CategoryID    452 non-null    int64
 4   Class         452 non-null    object
 5   ModifyDate    452 non-null    object
 6   Resistant     452 non-null    object
 7   IsAllergic    452 non-null    object
 8   VitalityDays  452 non-null    float64
dtypes: float64(2), int64(2), object(5)
memory usage: 31.9+ KB
Data Info:
None

SALES
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6758125 entries, 0 to 6758124
Data columns (total 9 columns):
 #   Column             Dtype
---  ------             -----
 0   SalesID            int64
 1   SalesPersonID      int64
 2   CustomerID         int64
 3   ProductID          int64
 4   Quantity           int64
 5   Discount           float64
 6   TotalPrice         float64
 7   SalesDate          object
 8   TransactionNumber  object
dtypes: float64(2), int64(5), object(2)
memory usage: 464.0+ MB
Data Info:
None

In [30]:
# Check for missing values
for table_name, table in tables.items():
    print(f"{table_name.upper()}")
    if table.isna().sum().sum() > 0: 
        print(f"Data Info: \n{table.isna().sum()} \n")
    else:
        print("No missing values present \n")

CATEGORIES
No missing values present

CITIES
No missing values present

COUNTRIES
Data Info:
CountryID      0
CountryName    0
CountryCode    1
dtype: int64

CUSTOMERS
Data Info:
CustomerID         0
FirstName          0
MiddleInitial    977
LastName           0
CityID             0
Address            0
dtype: int64

EMPLOYEES
No missing values present

PRODUCTS
No missing values present

SALES
Data Info:
SalesID                  0
SalesPersonID            0
CustomerID               0
ProductID                0
Quantity                 0
Discount                 0
TotalPrice               0
SalesDate            67526
TransactionNumber        0
dtype: int64

In [33]:
# Check if Column has no values
for table_name, table in tables.items():
    print(f"{table_name.upper()}")
    if (table == 0).all().sum() > 0:
        print(f"Data Info: \n{(table == 0).all()} \n")
    else:
        print("No columns with All-Zero-Values present \n")

CATEGORIES
No columns with All-Zero-Values present

CITIES
No columns with All-Zero-Values present

COUNTRIES
No columns with All-Zero-Values present

CUSTOMERS
No columns with All-Zero-Values present

EMPLOYEES
No columns with All-Zero-Values present

PRODUCTS
No columns with All-Zero-Values present

SALES
Data Info:
SalesID              False
SalesPersonID        False
CustomerID           False
ProductID            False
Quantity             False
Discount             False
TotalPrice            True
SalesDate            False
TransactionNumber    False
dtype: bool

In [23]:
# Checking duplicate rows 
for table_name, table in tables.items():
    print(f"{table_name.upper()}")
    if table.duplicated().sum().sum() > 0:
        print(f"Data Info: \n{table[table.duplicated()].sum()} \n")
    else:
        print("No duplicate values present \n")

CATEGORIES
No duplicate values present

CITIES
No duplicate values present

COUNTRIES
No duplicate values present

CUSTOMERS
No duplicate values present

EMPLOYEES
No duplicate values present

PRODUCTS
No duplicate values present

SALES

No duplicate values present

In [15]:
# Get the numerical summary statistics of the dataset
for table_name, table in tables.items():
    print(f"{table_name.upper()}")
    print(f"Data Info: \n{table.describe().round(3).T} \n")

CATEGORIES
Data Info:
            count  mean    std  min  25%  50%  75%   max
CategoryID   11.0   6.0  3.317  1.0  3.5  6.0  8.5  11.0

CITIES
Data Info:
           count       mean        std    min       25%      50%       75%  \
CityID      96.0     48.500     27.857    1.0     24.75     48.5     72.25
Zipcode     96.0  51245.302  29883.397  157.0  21780.50  51700.0  79867.75
CountryID   96.0     32.000      0.000   32.0     32.00     32.0     32.00

               max
CityID        96.0
Zipcode    97859.0
CountryID     32.0

COUNTRIES
Data Info:
           count   mean     std  min    25%    50%     75%    max
CountryID  206.0  103.5  59.611  1.0  52.25  103.5  154.75  206.0

CUSTOMERS
Data Info:
              count       mean        std  min      25%      50%      75%  \
CustomerID  98759.0  49380.000  28509.412  1.0  24690.5  49380.0  74069.5
CityID      98759.0     48.558     27.660  1.0     25.0     49.0     72.0

                max
CustomerID  98759.0
CityID         96.0

EMPLOYEES
Data Info:
            count    mean     std  min   25%   50%   75%   max
EmployeeID   23.0  12.000   6.782  1.0   6.5  12.0  17.5  23.0
CityID       23.0  43.783  26.382  4.0  20.5  39.0  65.0  92.0

PRODUCTS
Data Info:
              count     mean      std    min      25%    50%      75%      max
ProductID     452.0  226.500  130.625  1.000  113.750  226.5  339.250  452.000
Price         452.0   50.801   28.617  0.045   26.504   52.5   75.496   99.876
CategoryID    452.0    5.863    3.272  1.000    3.000    6.0    9.000   11.000
VitalityDays  452.0   26.031   39.061  0.000    0.000    0.0   52.500  120.000

SALES

Data Info:
                   count         mean          std  min        25%        50%  \
SalesID        6758125.0  3379063.000  1950902.788  1.0  1689532.0  3379063.0
SalesPersonID  6758125.0       12.000        6.633  1.0        6.0       12.0
CustomerID     6758125.0    49395.667    28505.043  1.0    24707.0    49414.0
ProductID      6758125.0      226.547      130.474  1.0      114.0      227.0
Quantity       6758125.0       13.004        7.210  1.0        7.0       13.0
Discount       6758125.0        0.030        0.064  0.0        0.0        0.0
TotalPrice     6758125.0        0.000        0.000  0.0        0.0        0.0

                     75%        max
SalesID        5068594.0  6758125.0
SalesPersonID       18.0       23.0
CustomerID       74075.0    98759.0
ProductID          340.0      452.0
Quantity            19.0       25.0
Discount             0.0        0.2
TotalPrice           0.0        0.0

In [16]:
# Get the categorical summary statistics of the dataset
for table_name, table in tables.items():
    print(f"{table_name.upper()}")
    print(f"Data Info: \n{table.describe(exclude = [np.number]).T} \n")

CATEGORIES
Data Info:
             count unique          top freq
CategoryName    11     11  Confections    1

CITIES
Data Info:
         count unique     top freq
CityName    96     96  Dayton    1

COUNTRIES
Data Info:
            count unique      top freq
CountryName   206    206  Armenia    1
CountryCode   205    205       AN    1

CUSTOMERS
Data Info:
               count unique             top  freq
FirstName      98759    969           Randi   141
MiddleInitial  97782     26               J  3826
LastName       98759    995          Dorsey   134
Address        98759  80134  16 Milton Road    10

EMPLOYEES
Data Info:
              count unique                      top freq
FirstName        23     22                 Chadwick    2
MiddleInitial    23     14                        E    3
LastName         23     23                   Fuller    1
BirthDate        23     23  1981-03-07 00:00:00.000    1
Gender           23      2                        M   15
HireDate         23     23  2011-06-20 07:15:36.920    1

PRODUCTS
Data Info:
            count unique                      top freq
ProductName   452    452  Napkin White - Starched    1
Class         452      3                   Medium  156
ModifyDate    452    452  2017-01-06 14:39:42.890    1
Resistant     452      3                  Durable  164
IsAllergic    452      3                    False  165

SALES
Data Info:
                     count   unique                      top freq
SalesDate          6690599  6670068  2018-02-22 00:55:15.420    3
TransactionNumber  6758125  6758125     RRBD7S603UIC73B631OF    1